{"original_index": 7, "label": "7", "prompt_excerpt": "The integer 119 is a multiple of which number?", "issue": "Question asks for a divisor of 119 without narrowing which divisor; both 7 and 17 satisfy. Current label keeps only 7, making the prompt ambiguous.", "suggested_fix": "Clarify the prompt (e.g., ask for the smallest prime factor) or accept both 7 and 17 as valid answers."}
{"original_index": 262, "label": "10", "prompt_excerpt": "Given that Kira needs to store 25 files onto disks, each with 2.0 MB of space, where 5 files take up 0.6 MB each, 10 files take up 1.0 MB each, and the rest take up 0.3 MB each, determine the minimum number of disks needed to store all 25 files.", "issue": "Computed minimum number of 2MB disks is 9, not 10. Greedy/DP packing shows 8 disks insufficient and 9 achievable.", "suggested_fix": "Update the label to 9; include sample packing: two 1MB files per disk for five disks, 0.6MB files grouped 3+2, remaining 0.3MB files on two disks."}
{"original_index": 8001, "label": "1512", "prompt_excerpt": "Given that $y$ is a multiple of $45678$, what is the greatest common divisor of $g(y)=(3y+4)(8y+3)(14y+9)(y+14)$ and $y$?", "issue": "Let y = 45678k. Then gcd(y, (3y+4)(8y+3)(14y+9)(y+14)) = 6*gcd(k,252). The answer depends on k; 1512 occurs only when k is divisible by 252.", "suggested_fix": "Return the general form 6*gcd(k,252) or constrain k (e.g., specify k=252)."}
{"original_index": 30373, "label": "34", "prompt_excerpt": "For how many even integers $n$ between 1 and 200 is the greatest common divisor of 18 and $n$ equal to 4?", "issue": "No even integer n has gcd(18,n)=4 because every common divisor of 18 must divide 18. Therefore the correct count is 0, not 34.", "suggested_fix": "Update label to 0 or adjust prompt conditions."}
{"original_index": 2015, "label": "2.8", "prompt_excerpt": "A right-angled triangle has sides of lengths 6, 8, and 10. A circle is drawn so that the area inside the circle but outside this triangle equals the area inside the triangle but outside the circle. The radius of the circle is closest to:", "issue": "Prompt references \"closest to\" but the self-contained statement omits the original answer choices or a rounding rule. Readers expecting an exact value would give $\\sqrt{24/\\pi}$ instead of the option-based 2.8.", "suggested_fix": "Add the multiple-choice options from the source problem or rephrase to \"Give the radius to the nearest tenth.\""}
{"original_index": 3718, "label": "56", "prompt_excerpt": "The plane is tiled by congruent squares and congruent pentagons as indicated. The percent of the plane that is enclosed by the pentagons is closest to\n[asy] unitsize(3mm); defaultpen(linewidth(0.8pt));  path p1=(0,0)--(3,0)--(3,3)--(0,3)--(0,0); path p2=(0,1)--(1,1)--(1,0); path p3=(2,0)--(2,1)--(3,1); path p4=(3,2)--(2,2)--(2,3); path p5=(1,3)--(1,2)--(0,2); path p6=(1,1)--(2,2); path p7=(2,1)--(1,2); path[] p=p1^^p2^^p3^^p4^^p5^^p6^^p7; for(int i=0; i<3; ++i) { for(int j=0; j<3; ++j) { draw(shift(3*i,3*j)*p); } } [/asy]", "issue": "Original AMC problem relied on a listed set of percentages; without those options the target rounding is unclear, so 56 lacks justification.", "suggested_fix": "Include the original answer choices or specify the rounding rule (e.g., \"nearest whole percent\")."}
{"original_index": 27650, "label": "10000", "prompt_excerpt": "The number of minutes in a week is closest to:", "issue": "Question references \"closest\" but the dataset drops the answer options, so 10000 is only justifiable relative to the missing list (1000, 5000, 10000, ...).", "suggested_fix": "Embed the multiple-choice options or restate as \"Round to the nearest thousand\"; otherwise use the exact value 10080."}
